package lesson3.staticTheme;

public class Main {
    public static void main(String[] args) {
        //static озгачає що під метод чи поле одразу виділяється память і до них можна жоступатися і без створення екземпляру класу
        //
        System.out.println(User.id); //100
//        System.out.println(User.name); це поле можна викликати тільки після створення екземпляру
        User user = new User();
        System.out.println(user);
        // коли ми встановимо айді для юзера і створимо нового юзера у всіх юзерів і просто в класа буде однакове значення айді
        user.setId(300);
        User user1 = new User();
        System.out.println(user);
        System.out.println(user1);
        System.out.println(User.id);
        // тобто це поле буде спільним для всіх екземплярів класу тому що під нього вже виділена комарка памяті

        // в нестатиному методі можна використовувати статичні поля і під ці методи буде виділятися память тіль під час виклику

        // статичний же метод не може працювати із нестатичними полями тому що ці поля повинні бути спочатку проініціалізовані при створенні
        // екземпляру а під статичний метод память виділяється відразу
        // статичні методи працюють тільки зі статичними данними
        // статичні класи працюють тільки зі статичними данними

        //статичними зазвичай роблять константи
        // зазвичай краще уникати статичності - вона забиває память
        // статичними можна робити тільки ті методи для яких не треба екземпляр класу

        // модифікатор FINAL
        // для класу - його не можна екстендити
        // метод - не можна буде перевизначити в класах які екстендаться
        // для поля - як const

    }
}
