package Homework3.part2.task2;

public class Main {
    public static void main(String[] args) {
//        1. ствоити інтрейфейс, імплеметувати його в 2 класи.
//                В класах є приватне поле meaasge.
//                Зробити всі необхідні маніпуляції для ініціалізації полів.
//        в  інтерфейсі визначити метод void scream(); який буде виводити інформацію в консоль.
//        В першому классі зробити реалізацію методу на вивід message "аааааааа!!!!!"
//        В другому класі зробити реалізацію методу на вивід massage "ууууууууу".
//
//                В головному класі. створити метод, котрий приймає об'єкт цього інтерфейсу і виконує його метод
        Custom custom = new Custom();
        custom.perform(new Class1());
        custom.perform(new Class2());
    }
}
